# Практика: pandas та matplotlib
---
У цьому ноутбуці зібрані завдання для практики роботи з бібліотеками **pandas** та **matplotlib**.

Спочатку виконай імпорт потрібних бібліотек, а потім рухайся по розділах.

In [14]:
# Імпорт основних бібліотек
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Розділ 1. Основи pandas: створення та перегляд даних
**Мета:** навчитися створювати `DataFrame`, переглядати структуру та базову інформацію.

**Завдання 1–10:**
1. Імпортуй бібліотеки `pandas` і `numpy` (вже зроблено вище, але спробуй сам у новій комірці).
2. Створи простий DataFrame з трьох стовпців: `"Name"`, `"Age"`, `"City"` (5–7 рядків).
3. Виведи перші 5 рядків DataFrame.
4. Виведи інформацію про типи даних (`.info()`) і статистику (`.describe()`).
5. Виведи назви всіх стовпців і індексів.
6. Зміни порядок стовпців у DataFrame.
7. Встанови стовпець `"Name"` як індекс.
8. Перейменуй стовпець `"City"` на `"Hometown"`.
9. Зроби копію DataFrame і додай новий стовпець `"Country"` зі значенням `"Ukraine"`.
10. Виведи тільки стовпці `"Name"` та `"Age"`.

In [3]:
# Розв'язання для завдань 1–10
# Напиши свій код нижче. Можеш додавати нові комірки, якщо потрібно.

# Твій код тут ↓

# 2 
df = pd.DataFrame({
    'Name':['Anna', 'Maria', 'Taras', 'Mark', 'Max'],
    'Age':[15, 20, 65, 12, 43],
    'City':['Kyiv', 'London', 'New York', 'Paris', 'Madrid']
})

In [4]:
df

    Name  Age      City
0   Anna   15      Kyiv
1  Maria   20    London
2  Taras   65  New York
3   Mark   12     Paris
4    Max   43    Madrid

In [15]:
# 3 Виведи інформацію про типи даних (.info()) і статистику (.describe())

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [ ]:
# 5a Виведи назви всіх стовпців 

df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [18]:
# 5b Виведи назви всіх індексів

df.index

RangeIndex(start=0, stop=5, step=1)

In [22]:
# 6 Зміни порядок стовпців у DataFrame

df = pd.DataFrame({
    'Name':['Anna', 'Maria', 'Taras', 'Mark', 'Max'],
    'Age':[15, 20, 65, 12, 43],
    'City':['Kyiv', 'London', 'New York', 'Paris', 'Madrid']
})

df = df[['City', 'Name', 'Age']]

df

       City   Name  Age
0      Kyiv   Anna   15
1    London  Maria   20
2  New York  Taras   65
3     Paris   Mark   12
4    Madrid    Max   43

In [25]:
#7 Встанови стовпець "Name" як індекс

print(df.loc[1])

City    London
Name     Maria
Age         20
Name: 1, dtype: object

In [26]:
#8 Перейменуй стовпець "City" на "Hometown"

df = df.rename(columns={'City':'Hometown'})

df

   Hometown   Name  Age
0      Kyiv   Anna   15
1    London  Maria   20
2  New York  Taras   65
3     Paris   Mark   12
4    Madrid    Max   43

In [27]:
#9 Додай новий стовпець "Country" зі значенням "Ukraine"

df['Country'] = 'Ukraine'

df

   Hometown   Name  Age  Country
0      Kyiv   Anna   15  Ukraine
1    London  Maria   20  Ukraine
2  New York  Taras   65  Ukraine
3     Paris   Mark   12  Ukraine
4    Madrid    Max   43  Ukraine

In [31]:
#10 Виведи тільки стовпці "Name" та "Age"

df[['Name', 'Age']]

    Name  Age
0   Anna   15
1  Maria   20
2  Taras   65
3   Mark   12
4    Max   43

## Розділ 2. Фільтрація та сортування
**Мета:** навчитися відбирати рядки за умовами, сортувати дані, працювати з індексами.

**Завдання 11–20:** (використовуй DataFrame з попереднього розділу або створи новий)
11. Вибери всі рядки, де `"Age" > 25`.   
12. Вибери всі рядки, де `"City"` (або `"Hometown"`) дорівнює `"Kyiv"`.  
13. Вибери рядки, де `"Age"` між 20 і 30 включно.  
14. Відсортуй таблицю за віком у порядку спадання.  
15. Відсортуй за двома стовпцями — спочатку `"City"`, потім `"Age"`.  
16. Перевір, чи є дублікати в `"Name"` і видали їх.  
17. Відфільтруй усіх користувачів, які **не** з Києва.  
18. Вибери випадкові 3 рядки з DataFrame (`.sample(3)`).  
19. Переміскай усі рядки DataFrame (за допомогою `.sample(frac=1)`).  
20. Додай новий рядок до DataFrame з вигаданими даними.

In [50]:
# Розв'язання для завдань 11–20
# Використовуй DataFrame з попереднього розділу (наприклад, df).

# Твій код тут ↓

#11 Вибери всі рядки, де "Age" > 25

df = pd.DataFrame({
    'Name':['Anna', 'Maria', 'Taras', 'Mark', 'Max'],
    'Age':[15, 20, 65, 12, 43],
    'City':['Kyiv', 'London', 'New York', 'Paris', 'Madrid']
})

more25 = df['Age'] > 25

df_filtered = df[more25]

pd.concat([more25])

0    False
1    False
2     True
3    False
4     True
Name: Age, dtype: bool

## Розділ 3. Робота з відсутніми значеннями (NaN)
**Мета:** навчитися виявляти, замінювати та видаляти пропущені значення.

**Завдання 21–26:**
21. Створи DataFrame з кількома пропущеними значеннями (`NaN`) у числових і текстових стовпцях.  
22. Замінити всі `NaN` у текстових стовпцях на `"Unknown"`.  
23. Замінити `NaN` у числових стовпцях на середнє значення відповідного стовпця.  
24. Видалити всі рядки, де хоча б одне значення пропущене.  
25. Перевір кількість пропущених значень у кожному стовпці (`.isna().sum()`).  
26. Створи DataFrame з числовими і текстовими стовпцями та перевір `.dtypes`.

In [7]:
# Розв'язання для завдань 21–26
# Підказка: використовуй np.nan для створення пропусків.

# Твій код тут ↓

## Розділ 4. Групування, агрегація, статистика
**Мета:** навчитися використовувати `groupby`, агрегації, зведені таблиці.

**Завдання 27–35:**
27. Створи DataFrame про продажі з колонками: `"Product"`, `"Category"`, `"Price"`, `"Quantity"` (10–15 рядків).  
28. Знайди загальний дохід (`Price * Quantity`) і додай його як новий стовпець `"Revenue"`.  
29. Порахуйте загальний дохід для кожної категорії (`groupby("Category")["Revenue"].sum()`).  
30. Знайди середню ціну по кожному `"Product"`.  
31. Визнач найпопулярніший товар (за сумарною кількістю продажів).  
32. Знайди мінімальний і максимальний дохід по категорії.  
33. Зроби зведену таблицю (`pivot_table`) з категоріями по рядках і середнім доходом по стовпцях.  
34. Відсортуй категорії за середнім доходом.  
35. Додай стовпець `"Profit" = "Revenue" * 0.25` і знайди середній прибуток по категоріях.

In [8]:
# Розв'язання для завдань 27–35
# Підказка: можеш згенерувати випадкові дані за допомогою np.random.

# Твій код тут ↓

## Розділ 5. Злиття, об’єднання та збереження даних
**Мета:** навчитися з'єднувати таблиці, знаходити відсутні зв'язки, зберігати дані в CSV.

**Завдання 36–40:**
36. Створи два DataFrame: `customers` і `orders`:
   - `customers`: `CustomerID`, `Name`, `City`  
   - `orders`: `OrderID`, `CustomerID`, `Amount`  
   З’єднай їх за `CustomerID` (`pd.merge`).  
37. Об’єднай дві таблиці вертикально (`pd.concat`).  
38. Знайди клієнтів, які **не мають** замовлень (left join + `NaN` у `"Amount"`).  
39. Збережи результат у CSV-файл (`.to_csv("customers_orders.csv", index=False)`) і потім зчитай його назад (`pd.read_csv`).  
40. Перевір, чи зчитані типи даних збігаються з оригіналом (порівняй `.dtypes`).

In [9]:
# Розв'язання для завдань 36–40
# Твій код тут ↓

## Розділ 6. Робота з датами і часом
**Мета:** навчитися працювати з датами, витягати компоненти дати, фільтрувати за часом.

**Завдання 41–45:**
41. Створи DataFrame з колонкою `"date"` від `"2024-01-01"` до `"2024-01-10"` (використай `pd.date_range`).  
42. Додай новий стовпець `"day_of_week"`, що показує день тижня.  
43. Вибери всі дні вихідного (`Saturday`, `Sunday`).  
44. Знайди різницю між найпізнішою та найранішою датою (`date.max() - date.min()`).  
45. Додай колонку `"month"` і порахуй, скільки записів у кожному місяці.

In [10]:
# Розв'язання для завдань 41–45
# Твій код тут ↓

## Розділ 7. Основи matplotlib
**Мета:** навчитися будувати базові графіки з використанням `matplotlib`.

**Завдання 46–50:**
46. Імпортуй бібліотеку `matplotlib.pyplot` під псевдонімом `plt` (вже зроблено вище, але спробуй окремо).  
47. Побудуй простий лінійний графік:  
   ```python  
   x = [1, 2, 3, 4, 5]  
   y = [10, 8, 6, 4, 2]  
   plt.plot(x, y)  
   plt.show()  
   ```
48. Додай підписи осей (`xlabel`, `ylabel`) і заголовок (`title`).  
49. Змініть зовнішній вигляд лінії: стиль (`'--'`, `'-.'`), маркери (`'o'`, `'s'`), товщину (`linewidth`).  
50. Побудуй **два графіки на одному полі** (додай другий виклик `plt.plot()` перед `plt.show()`).

In [11]:
# Розв'язання для завдань 46–50
# Твій код тут ↓

## Розділ 8. Графіки з pandas + matplotlib
**Мета:** навчитися будувати графіки безпосередньо з DataFrame.

**Завдання 51–60:**
51. Створи DataFrame з продажами по місяцях: стовпці `"Month"`, `"Revenue"`.  
52. Побудуй лінійний графік `Revenue` по місяцях (`df.plot(x="Month", y="Revenue")`).  
53. Побудуй стовпчикову діаграму продажів по категоріях (`bar`).  
54. Побудуй горизонтальну стовпчикову діаграму (`barh`).  
55. Побудуй кругову діаграму (`pie`) для відсотку продажів по категоріях.  
56. Створи DataFrame з віком клієнтів і побудуй гістограму розподілу віку (`hist`).  
57. Побудуй `boxplot` для цін (`Price`).  
58. Побудуй `scatter plot` між `"Price"` і `"Quantity"`.  
59. Зміни стиль графіка (наприклад, `plt.style.use("ggplot")`).  
60. Додай підписи значень на стовпчиковому графіку (через `plt.text` або `ax.bar_label()`).

In [12]:
# Розв'язання для завдань 51–60
# Твій код тут ↓

## Розділ 9. Комбіновані завдання (pandas + matplotlib)
**Мета:** поєднати обробку даних та візуалізацію.

**Завдання 61–70:**
61. Створи або зчитай з CSV DataFrame з даними про продажі: дата, товар, категорія, ціна, кількість, місто.  
62. Порахуйте загальний дохід по місяцях і побудуйте лінійний графік.  
63. Визнач топ-3 товари за продажами (за `Revenue`) і побудуй для них стовпчиковий графік.  
64. Побудуй порівняння доходів по містах (стовпчиковий графік).  
65. Обчисли кореляцію між числовими стовпцями (`df.corr()`) і побудуй `heatmap` (через `plt.imshow` або іншу бібліотеку).  
66. Побудуй `subplot` із двома графіками: лінійний (Revenue по місяцях) і стовпчиковий (Revenue по категоріях).  
67. Створи кілька серій даних (наприклад, Revenue за 2 роки) і побудуй їх разом на одному графіку з легендою.  
68. Побудуй графік із вторинною віссю (`twinx`): стовпчики для Revenue і лінія для середньої ціни.  
69. Збережи один із графіків у PNG-файл (`plt.savefig("sales_chart.png", dpi=300)`).  
70. Зроби зведену таблицю продажів по місяцях і побудуй її графік одразу з pandas (`pivot_table` + `.plot()`).

In [13]:
# Розв'язання для завдань 61–70
# Твій код тут ↓